{"7jTAf1Cv2OpqdGoBhIhaq2": {"id": "7jTAf1Cv2OpqdGoBhIhaq2", "name": "This Filipino American Life", "description": "A podcast that explores the nuanced experiences of Filipinos in the United States, atbp.", "genre": "arts entertainment", "languages": ["en"], "publisher": "This Filipino American Life", "show_rank": "1"}, "20Gf4IAauFrfj7RBkjcWxh": {"id": "20Gf4IAauFrfj7RBkjcWxh", "name": "Hidden Brain", "description": "Shankar Vedantam uses science and storytelling to reveal the unconscious patterns that drive human behavior, shape our choices and direct our relationships.", "genre": "science", "languages": ["en"], "publisher": "Hidden Brain", "show_rank": "5"}, "2b025hq3gJ17tQdxS3aV43": {"id": "2b025hq3gJ17tQdxS3aV43", "name": "Dissect", "description": "Learn more about the albums you love with Dissect. Analyzing one album per season, one song per episode, Dissect dives deep into albums like Kanye West's Twisted Fantasy & Yeezus, Beyonce's Lemonade, Kendrick Lamar's To Pimp a Butterfly & DAMN., Frank Ocean's Blonde, Childish Gambino's Because the Internet, and more. Let's Dissect.", "genre": "music", "languages": ["en"], "publisher": "Spotify Studios", "show_rank": "3"}, "6L47MDMO3xuN2XBed7miEI": {"id": "6L47MDMO3xuN2XBed7miEI", "name": "WTF with Marc Maron Podcast", "description": "Marc Maron welcomes comedians, actors, directors, writers, authors, musicians and folks from all walks of life to his home for amazingly revealing conversations. Marc's probing, comprehensive interview style allows guests to express themselves in ways listeners have never heard.", "genre": "tv film", "languages": ["en"], "publisher": "Marc Maron", "show_rank": "4"}, "5pwBAjuJJAOt7cED5Lkjnk": {"id": "5pwBAjuJJAOt7cED5Lkjnk", "name": "The Magnus Archives", "description": "“Make your statement, face your fear.” A weekly horror fiction podcast examining what lurks in the archives of the Magnus Institute, an organisation dedicated to researching the esoteric and the weird. Join Jonathan Sims as he explores the archive, but be be warned, as he looks into its depths something starts to look back… New episodes every Thursday produced by Rusty Quill, featuring guest actors, short stories, serial plots and more.", "genre": "stories", "languages": ["en"], "publisher": "Rusty Quill", "show_rank": "8"}, "5mrS2aDwNdAAwlqRkvNVFd": {"id": "5mrS2aDwNdAAwlqRkvNVFd", "name": "Let's Not Meet: A True Horror Podcast", "description": "True horror stories written by those that made it out alive. First person accounts narrated and produced by Andrew Tate in an anthology of terror and suspense.", "genre": "arts entertainment", "languages": ["en"], "publisher": "Andrew Tate", "show_rank": "6"}, "5Sffly5o4mPetmnTR9zsWh": {"id": "5Sffly5o4mPetmnTR9zsWh", "name": "Dungeons and Daddies", "description": "A D&D real play podcast about four dads from our world transported into a realm of high fantasy and magic, and their quest to rescue their sons. Not a BDSM podcast!", "genre": "leisure", "languages": ["en"], "publisher": "Dungeons and Daddies", "show_rank": "6"}, "36SPp0UJlpM9TDacDHMhEC": {"id": "36SPp0UJlpM9TDacDHMhEC", "name": "The Bald and the Beautiful with Trixie Mattel and Katya Zamo", "description": "The Bald and the Beautiful with Trixie Mattel and Katya Zamo features a pair of grizzled gay ghouls exploring the cultural boundaries of modern beauty through interviews with gorgeous guests who inhabit various facets of the beauty industry. From models, moguls, influencers, drag queens to adult performers, actors, and more, Trixie and Katya break down the beauty behind it all. Subscribe to the ad-free version: https://thebaldandthebeautiful.supercast.tech/ For advertising opportunities please email PodcastPartnerships@Studio71us.com", "genre": "arts entertainment", "languages": ["en"], "publisher": "Studio71", "show_rank": "8"}, "2VRS1IJCTn2Nlkg33ZVfkM": {"id": "2VRS1IJCTn2Nlkg33ZVfkM", "name": "99% Invisible", "description": "       Design is everywhere in our lives, perhaps most importantly in the places where we've just stopped noticing. 99% Invisible is a weekly exploration of the process and power of design and architecture. From award winning producer Roman Mars. Learn more at 99percentinvisible.org.    A proud member of Radiotopia, from PRX. Learn more at radiotopia.fm.     ", "genre": "arts entertainment", "languages": ["en-US"], "publisher": "Roman Mars", "show_rank": "9"}, "5XhS5WBxLYgN3S9KhEyrrF": {"id": "5XhS5WBxLYgN3S9KhEyrrF", "name": "The NoSleep Podcast", "description": "The NoSleep Podcast is a multi-award winning anthology series of original horror stories, with rich atmospheric music to enhance the frightening tales.", "genre": "stories", "languages": ["en"], "publisher": "David Cummings", "show_rank": "10"}, "1VXcH8QHkjRcTCEd88U3ti": {"id": "1VXcH8QHkjRcTCEd88U3ti", "name": "TED Talks Daily", "description": "Every weekday, TED Talks Daily brings you the latest talks in audio. Join host and journalist Elise Hu for thought-provoking ideas on every subject imaginable — from Artificial Intelligence to Zoology, and everything in between — given by the world's leading thinkers and creators. With TED Talks Daily, find some space in your day to change your perspectives, ignite your curiosity, and learn something new.  ", "genre": "society culture", "languages": ["en"], "publisher": "TED", "show_rank": "9"}, "4FYpq3lSeQMAhqNI81O0Cn": {"id": "4FYpq3lSeQMAhqNI81O0Cn", "name": "Planet Money", "description": "The economy explained. Imagine you could call up a friend and say, \"Meet me at the bar and tell me what's going on with the economy.\" Now imagine that's actually a fun evening.", "genre": "news politics", "languages": ["en"], "publisher": "NPR", "show_rank": "10"}, "5pjCh71RVk9oE6DXagcKyK": {"id": "5pjCh71RVk9oE6DXagcKyK", "name": "BFFs featuring Josh Richards and Dave Portnoy", "description": "Worlds collide as newly minted best friends Dave Portnoy and Josh Richards team up to bring you BFFs. Dropping weekly, the two talk about everything from dominating Tiktok in LA to running a media empire in NYC", "genre": "business technology", "languages": ["en"], "publisher": "Barstool Sports", "show_rank": "3"}, "6E709HRH7XaiZrMfgtNCun": {"id": "6E709HRH7XaiZrMfgtNCun", "name": "How I Built This with Guy Raz", "description": "Guy Raz dives into the stories behind some of the world's best known companies. How I Built This weaves a narrative journey about innovators, entrepreneurs and idealists—and the movements they built. Order the How I Built This book at https://www.guyraz.com/", "genre": "business technology", "languages": ["en-US"], "publisher": "NPR", "show_rank": "4"}, "706hylM6zaDW8LrrYxcggQ": {"id": "706hylM6zaDW8LrrYxcggQ", "name": "The Mindset Mentor", "description": "The Mindset Mentor™ podcast is designed for anyone desiring motivation, direction, and focus in life. Host Rob Dial has amassed a passionate following of over 2 million social media followers, including business professionals, entrepreneurs, and small business owners with his expertise and passion for helping motivate people to become the best version of themselves. Rob challenges his audience to live a life of love and purpose. Rob has been featured in Forbes and Inc. for his ability to connect with his listeners. Over the past 15 years he has studied with some of the greatest thought leaders of our time like Tony Robbins, Ram Dass, Dr. Joe Dispenza, Jay Shetty and many more. Tune in if you're ready to take your life to the next level.Follow Rob on Instagram @RobDialJr https://www.instagram.com/robdialjr/", "genre": "lifestyle health", "languages": ["en"], "publisher": "Rob Dial and Kast Media", "show_rank": "8"}, "5RllMBgvDnTau8nnsCUdse": {"id": "5RllMBgvDnTau8nnsCUdse", "name": "Snacks Daily", "description": "Digestible financial news. Get smarter fast with an entertaining breakdown of our top 3 business stories in 15 minutes. Pairs perfectly with your commute, workout, or morning oatmeal ritual. Hosted by Jack Kramer and Nick Martell.", "genre": "business technology", "languages": ["en"], "publisher": "Robinhood Financial, LLC", "show_rank": "7"}, "5exfRPDNCBHmntEkJrlLmX": {"id": "5exfRPDNCBHmntEkJrlLmX", "name": "The Ramsey Show", "description": "Take control of your life and money once and for all. The Ramsey Show offers up straight talk from Dave Ramsey and his team of co-hosts. Millions listen in as callers from all walks of life learn how to get out of debt and start building for the future. Check out one of Apple’s most popular podcasts! For more information, visit www.daveramsey.com.", "genre": "business technology", "languages": ["en"], "publisher": "Ramsey Network", "show_rank": "8"}, "5J0xAfsLX7bEYzGxOin4Sd": {"id": "5J0xAfsLX7bEYzGxOin4Sd", "name": "Life Kit", "description": "Everyone needs a little help being a human. From sleep to saving money to parenting and more, we talk to the experts to get the best advice out there. Life Kit is here to help you get it together.", "genre": "science", "languages": ["en-US"], "publisher": "NPR", "show_rank": "10"}, "5qSUyCrk9KR69lEiXbjwXM": {"id": "5qSUyCrk9KR69lEiXbjwXM", "name": "The Tim Ferriss Show", "description": "       Tim Ferriss is a self-experimenter and bestselling author, best known for The 4-Hour Workweek, which has been translated into 40+ languages.  Newsweek calls him \"the world's best human guinea pig,\" and The New York Times calls him \"a cross between Jack Welch and a Buddhist monk.\"  In this show, he deconstructs world-class performers from eclectic areas (investing, chess, pro sports, etc.), digging deep to find the tools, tactics, and tricks that listeners can use.     ", "genre": "business technology", "languages": ["en"], "publisher": "Tim Ferriss: Bestselling Author, Human Guinea Pig", "show_rank": "10"}, "4rOoJ6Egrf8K2IrywzwOMk": {"id": "4rOoJ6Egrf8K2IrywzwOMk", "name": "The Joe Rogan Experience", "description": "The official podcast of comedian Joe Rogan. Follow The Joe Rogan Clips show page for some of the best moments from the episodes.", "genre": "comedy", "languages": ["en-US"], "publisher": "Joe Rogan", "show_rank": "1"}, "7bnjJ7Va1nM07Um4Od55dW": {"id": "7bnjJ7Va1nM07Um4Od55dW", "name": "Call Her Daddy", "description": "Follow along Alex Cooper and the Daddy Gang as they exploit the details of their lives, making you feel a hell of a lot better about yours. Relationships, sex, social scenes, embarrassing moments, and more are all addressed here on CALL HER DADDY. See you f****** Wednesday.", "genre": "comedy", "languages": ["en-US"], "publisher": "Barstool Sports", "show_rank": "2"}, "3yZg2MCkf31pPXiG4nznrg": {"id": "3yZg2MCkf31pPXiG4nznrg", "name": "Last Podcast On The Left", "description": "The Last Podcast On The Left covers all the horrors our world has to offer both imagined and real, from demons and slashers to cults and serial killers, The Last Podcast is guaranteed to satisfy your blood lust.", "genre": "true crime", "languages": ["en"], "publisher": "The Last Podcast Network", "show_rank": "1"}, "0U9S5J2ltMaKdxIfLuEjzE": {"id": "0U9S5J2ltMaKdxIfLuEjzE", "name": "My Favorite Murder with Karen Kilgariff and Georgia Hardstark", "description": "Lifelong fans of true crime stories Karen Kilgariff and Georgia Hardstark tell each other their favorite tales of murder and hear hometown crime stories from friends and fans. ", "genre": "true crime", "languages": ["en"], "publisher": "Exactly Right", "show_rank": "4"}, "1cpyLfDHP1cNnyOb478qrt": {"id": "1cpyLfDHP1cNnyOb478qrt", "name": "Morbid: A True Crime Podcast", "description": "It’s a lighthearted nightmare in here, weirdos! Morbid is a true crime, creepy history and all things spooky podcast hosted by an autopsy technician and a hairstylist. Join us for a heavy dose of research with a dash of comedy thrown in for flavor.", "genre": "true crime", "languages": ["en-US"], "publisher": "Morbid: A True Crime Podcast", "show_rank": "3"}, "6kAsbP8pxwaU2kPibKTuHE": {"id": "6kAsbP8pxwaU2kPibKTuHE", "name": "Armchair Expert with Dax Shepard", "description": "Hi, I’m Dax Shepard, and I love talking to people. I am endlessly fascinated by the messiness of being human, and I find people who are vulnerable and honest about their struggles and shortcomings to be incredibly sexy. I invite you to join me as I explore other people’s stories. We will celebrate, above all, the challenges and setbacks that ultimately lead to growth and betterment. What qualifies me for such an endeavor? More than a decade of sobriety, a degree in Anthropology and four years of improv training. I will attempt to discover human “truths” without any laboratory work, clinical trials or data collection. I will be, in the great tradition of 16th-century scientists, an Armchair Expert.", "genre": "tv film", "languages": ["en"], "publisher": "Armchair Umbrella", "show_rank": "1"}, "3OHCFs84lqizjkL4C9bNTA": {"id": "3OHCFs84lqizjkL4C9bNTA", "name": "Office Ladies", "description": "The Office co-stars and best friends, Jenna Fischer and Angela Kinsey, are doing the ultimate The Office re-watch podcast for you. Each week Jenna and Angela will break down an episode of The Office and give exclusive behind the scene stories that only two people who were there, can tell you.", "genre": "comedy", "languages": ["en"], "publisher": "Earwolf & Jenna Fischer and Angela Kinsey", "show_rank": "7"}, "3jtZt3VSBbBJPwrCGIeyc0": {"id": "3jtZt3VSBbBJPwrCGIeyc0", "name": "The Misfits Podcast", "description": "The most scuffed podcast on the internet.", "genre": "games", "languages": ["en"], "publisher": "Misfits Network", "show_rank": "2"}, "7ydBWzs9BSRh97tsCjOhby": {"id": "7ydBWzs9BSRh97tsCjOhby", "name": "H3 Podcast", "description": "The official podcast of comedians Ethan & Hila Klein of h3h3productions.", "genre": "comedy", "languages": ["en"], "publisher": "Ethan and Hila Klein", "show_rank": "9"}, "3u26tlz7A3WyWRtXliX9a9": {"id": "3u26tlz7A3WyWRtXliX9a9", "name": "Conan O’Brien Needs A Friend", "description": "After 25 years at the Late Night desk, Conan realized that the only people at his holiday party are the men and women who work for him.Over the years and despite thousands of interviews, Conan has never made a real and lasting friendship with any of his celebrity guests. So, he started a podcast to do just that.Deeper, unboundedly playful, and free from FCC regulations, Conan O’Brien Needs a Friend is a weekly opportunity for Conan to hang out with the people he enjoys most and perhaps find some real friendship along the way.", "genre": "comedy", "languages": ["en"], "publisher": "Team Coco & Earwolf", "show_rank": "10"}, "4P86ZzHf7EOlRG7do9LkKZ": {"id": "4P86ZzHf7EOlRG7do9LkKZ", "name": "Unlocking Us with Brené Brown", "description": "I’ve spent over 20 years studying the emotions and experiences that bring meaning and purpose to our lives, and if there’s one thing I’ve learned it’s this: We are hardwired for connection, and connecting requires courage, vulnerability, and conversation. I want this to be a podcast that’s real, unpolished, honest, and reflects both the magic and the messiness of what it means to be human. Episodes will include conversations with the people who are teaching me, challenging me, confusing me, or maybe even ticking me off a little. I'll also have direct conversations with you about what I’m learning from new research, and we'll do some episodes dedicated to answering your questions. We don’t have to do life alone. We were never meant to.", "genre": "society culture", "languages": ["en"], "publisher": "Parcast Network", "show_rank": "4"}, "1iID17CHsqI00CTrLFheMx": {"id": "1iID17CHsqI00CTrLFheMx", "name": "ASMR Eating", "description": "Join me while I complete my 30-day ASMR Eating Podcast Challenge. I'm hoping to improve throughout the challenge, so feedback is welcome!   Most episodes will be Vegan friendly, and I never eat Mammals.  Will I start an ASMR YouTube Channel at the end? Let's find out!", "genre": "society culture", "languages": ["en"], "publisher": "ASMR Eating", "show_rank": "6"}, "4ruq7mH0jg1sFi8KQhnGb8": {"id": "4ruq7mH0jg1sFi8KQhnGb8", "name": "Serial Killers", "description": "Every Monday and Thursday, Serial Killers takes a psychological and entertaining approach to provide a rare glimpse into the mind, methods and madness of the most notorious serial killers with the hopes of better understanding their psychological profile. With the help of in-depth research, we delve deep into their lives and stories. Serial Killers is part of the Parcast Network and is a Cutler Media Production.", "genre": "true crime", "languages": ["en"], "publisher": "Parcast Network", "show_rank": "6"}, "0Yzd0g8NYmn27k2HFNplv7": {"id": "0Yzd0g8NYmn27k2HFNplv7", "name": "SmartLess", "description": "\"SmartLess\" with Jason Bateman, Sean Hayes, & Will Arnett is a podcast that connects and unites people from all walks of life to learn about shared experiences through thoughtful dialogue and organic hilarity. A nice surprise: in each episode of SmartLess, one of the hosts reveals his mystery guest to the other two. What ensues is a genuinely improvised and authentic conversation filled with laughter and newfound knowledge to feed the SmartLess mind. ", "genre": "stories", "languages": ["en"], "publisher": "Jason Bateman, Sean Hayes, Will Arnett", "show_rank": "5"}, "3yxUnWt3TJWXaKuRU2sLOg": {"id": "3yxUnWt3TJWXaKuRU2sLOg", "name": "Shots of Science Vs", "description": "Quick hits of Science Vs, where we take on fads, trends, and the opinionated mob to find out what's fact, what's not, and what's somewhere in between. Want more fun? Go to Science Vs on Spotify.", "genre": "science", "languages": ["en"], "publisher": "Gimlet", "show_rank": "3"}, "5lY4b5PGOvMuOYOjOVEcb9": {"id": "5lY4b5PGOvMuOYOjOVEcb9", "name": "Science Vs", "description": "There are a lot of fads, blogs and strong opinions, but then there’s SCIENCE. Science Vs is the show from Gimlet that finds out what’s fact, what’s not, and what’s somewhere in between. We do the hard work of sifting through all the science so you don't have to and cover everything from 5G and Pandemics, to Vaping and Fasting Diets.", "genre": "science", "languages": ["en"], "publisher": "Gimlet", "show_rank": "6"}, "4Lua9IGzQZ17PMv5V9qW3N": {"id": "4Lua9IGzQZ17PMv5V9qW3N", "name": "Every Little Thing Minis", "description": "A fun, bite-sized fact show that tackles your burning questions. Like: Why do we cry? Did cavemen really carry clubs? Why are some people mosquito magnets?", "genre": "science", "languages": ["en"], "publisher": "Gimlet", "show_rank": "9"}, "6OoAQesdLgYBOyfx8ji0bZ": {"id": "6OoAQesdLgYBOyfx8ji0bZ", "name": "The Adventure Zone", "description": "Justin, Travis and Griffin McElroy from My Brother, My Brother and Me have recruited their dad Clint for a campaign of high adventure. Join the McElroys as they find their fortune and slay an unconscionable number of ... you know, kobolds or whatever in ... The Adventure Zone..", "genre": "stories", "languages": ["en"], "publisher": "The McElroys", "show_rank": "3"}, "1g056e2x0Y9AwW6CQF3qA5": {"id": "1g056e2x0Y9AwW6CQF3qA5", "name": "Mythology", "description": "Myths endure for a reason. This episodic audio drama brings ancient myths to life for the modern audience. Each episode presents exciting stories and analysis of each myth's history and origins, giving insight into how our ancestors saw the universe. Mythology releases a new episode every Tuesday. Mythology is a production of Cutler Media and part of the Parcast Network.", "genre": "fiction", "languages": ["en"], "publisher": "Parcast Network", "show_rank": "3"}, "0s6Wc5qf8SIvCtKZNC6N7s": {"id": "0s6Wc5qf8SIvCtKZNC6N7s", "name": "Welcome to Night Vale", "description": "       Twice-monthly community updates for the small desert town of Night Vale, where every conspiracy theory is true. Turn on your radio and hide. Never listened before? It's an ongoing radio show. Start with the current episode, and you'll catch on in no time. Or, go right to Episode 1 if you wanna binge-listen.     ", "genre": "fiction", "languages": ["en"], "publisher": "Night Vale Presents", "show_rank": "4"}, "6D2fkwIM6qc7FEeWGlJwqK": {"id": "6D2fkwIM6qc7FEeWGlJwqK", "name": "Scary Story Podcast", "description": "Scary Story Podcast features scary stories about darkness, unexplained phenomena, and the paranormal. A collection of short original horror tales made to unsettle you. For more, visit ScaryPod.com", "genre": "fiction", "languages": ["en"], "publisher": "Scary Stories", "show_rank": "6"}, "6wegpF4BHu5dQG7sTg1Cz9": {"id": "6wegpF4BHu5dQG7sTg1Cz9", "name": "Nothing much happens; bedtime stories to help you sleep", "description": "Having trouble sleeping?  Join Yoga and meditation teacher Kathryn Nicolai for bedtime stories where nothing much happens to help you relax and sleep peacefully. The stories are a soft landing spot for your mind. Rather than letting your brain race through the same thoughts you’ve been chasing all day, we are taking a detour to a calm and comfy place. We tell the story twice and go a bit slower the second time. Buy the book now! http://hyperurl.co/NothingMuchHappens", "genre": "fiction", "languages": ["en"], "publisher": "Curiouscast", "show_rank": "7"}, "5GcTIDkgnB9wP6CmUyOSqa": {"id": "5GcTIDkgnB9wP6CmUyOSqa", "name": "Not Another D&D Podcast", "description": "       Welcome to the campaign after the campaign! Three unlikely adventurers attempt to right the wrongs caused by a party of legendary heroes who screwed up the world while trying to save it. DM Brian Murphy is joined by Emily Axford, Jake Hurwitz, and Caldwell Tanner for this D&D play podcast.      ", "genre": "leisure", "languages": ["en"], "publisher": "Headgum", "show_rank": "7"}, "0ROR5DBcqHUQIiY2AQgdAh": {"id": "0ROR5DBcqHUQIiY2AQgdAh", "name": "Scared To Death", "description": "True horror fan Dan Cummins attempts to terrify his wife Lynze with two new alleged-to-be-true tales each week. Demonic possession, poltergeists, shadow people, and more! Subscribe and listen in the dark to your new weekly nightmare.", "genre": "fiction", "languages": ["en"], "publisher": "Dan Cummins", "show_rank": "9"}, "3zJocTtOT4QsObuvmQr6C2": {"id": "3zJocTtOT4QsObuvmQr6C2", "name": "L’Manburg Anthem", "description": "L’Manburg Anthem", "genre": "fiction", "languages": ["en"], "publisher": "Ella Gilluley", "show_rank": "10"}, "3W8pwzlQAsAeOBrgZeReqJ": {"id": "3W8pwzlQAsAeOBrgZeReqJ", "name": "Mom's Basement", "description": "Every week, the internet’s most authentic voices, FaZe Banks, Killer Keemstar and Colossal is Crazy spill the tea on the hottest topics and talk to the biggest names from every corner of the internet. If you’re into creator and gaming culture, you need to listen to this Spotify exclusive now. New episodes drop every Wednesday.", "genre": "leisure", "languages": ["en"], "publisher": "Spotify Studios", "show_rank": "3"}, "0dWpNy3iA6Mm3xYaHB2Zi9": {"id": "0dWpNy3iA6Mm3xYaHB2Zi9", "name": "Wait Wait... Don't Tell Me!", "description": "NPR's weekly current events quiz. Have a laugh and test your news knowledge while figuring out what's real and what we've made up.", "genre": "leisure", "languages": ["en"], "publisher": "NPR", "show_rank": "2"}, "7e8zPFBpW0DtgyrrPnt0xT": {"id": "7e8zPFBpW0DtgyrrPnt0xT", "name": "Critical Role", "description": "Welcome to Critical Role, where a bunch of nerdy-ass voice actors sit around and play Dungeons & Dragons! Join Dungeon Master Matthew Mercer and an all-star cast of world-class performers each week as they travel through imaginary realms for more adventure than you can shake a magic staff at. Need a deeper dive? Be sure to catch Talks Machina with Brian W. Foster, the official Critical Role companion show, right here on Critical Role.", "genre": "leisure", "languages": ["en-US"], "publisher": "Critical Role", "show_rank": "8"}, "6TXzjtMTEopiGjIsCfvv6W": {"id": "6TXzjtMTEopiGjIsCfvv6W", "name": "The Official Podcast", "description": "The Official Podcast is where four international man friends congregate to discuss just about everything. Featuring dumb questions, YouTube celebrities, childish giggling, burger puns, more dumb questions, fatherly advice, bad dating stories, even more dumb questions, and a slew of guest stars, The Official Podcast is a weekly show with a little something for everyone. Jackson, Andrew, Charlie, and Kaya gather to talk about only the most important things in life every Thursday at 8pm EST. ", "genre": "games", "languages": ["en"], "publisher": "The Official Podcast", "show_rank": "8"}, "5JFugv0GD68SZC0Cuh1wXi": {"id": "5JFugv0GD68SZC0Cuh1wXi", "name": "The Besties", "description": "It's Game of the Year meets King of the Hill as four of Earth's best friends – Griffin McElroy, Justin McElroy, Chris Plante, and Russ Frushtick – rank and review their favorite video games. Because shouldn't the world's best friends pick the world's best games?", "genre": "games", "languages": ["en"], "publisher": "Justin McElroy, Griffin McElroy, Chris Plante, Russ Frushtick", "show_rank": "10"}, "2bAmrw0xKnOhOx4hqSL7vF": {"id": "2bAmrw0xKnOhOx4hqSL7vF", "name": "Relaxing White Noise", "description": "Welcome to Relaxing White Noise, the podcast featuring white noise and nature sounds to help you sleep, study or soothe a baby. We make relaxing sounds to improve your life and are excited to share them with you. Join the hundred million people who have already enjoyed our white noise soundscapes which include rain sounds, ocean waves, white noise for babies, fan sounds, spaceships, Tibetan bowls, waterfalls and rain with thunder. Whether you're trying to study for a test, focus at work, fall asleep or simply relax, we have the perfect white noise sound for you. Cheers to feeling your best! Support this podcast: https://anchor.fm/relaxingwhitenoise/support", "genre": "lifestyle health", "languages": ["en"], "publisher": "Relaxing White Noise, LLC", "show_rank": "1"}, "4VLmupvAo7qt1MiOpy1oA5": {"id": "4VLmupvAo7qt1MiOpy1oA5", "name": "Sol Good Sounds", "description": "Check out our collection of eclectic podcasts, free offerings, & other content to help you relax and meditate at: www.solgood.org  Want To Support Future Podcast Episodes www.anchor.fm/solgoodsounds/support  Subscribe To Our YouTube Channel www.solgood.org/subscribe", "genre": "lifestyle health", "languages": ["en"], "publisher": "Solgood Sounds", "show_rank": "2"}, "2BdDWHUpDx5CiVYh6F4KIT": {"id": "2BdDWHUpDx5CiVYh6F4KIT", "name": "Tmsoft's White Noise Sleep Sounds", "description": "Having trouble sleeping, focusing, relaxing? We've got you covered! From white noise to nature sounds and everything in between, our 60 minute podcasts are made to help you focus, relax, and sleep better.  Download our free White Noise apps for continuous playback of all these great sounds. Visit https://whitenoise.app from your device to download or https://www.tmsoft.com/ for additional details.  Stream our sounds on Spotify, Amazon, YouTube Music, and more! Just look for Tmsoft's White Noise Sleep Sounds.  Relax. Sleep. Better.", "genre": "lifestyle health", "languages": ["en"], "publisher": "TMSOFT", "show_rank": "3"}, "7l1sgTpu8WoVJCVjIdRLLE": {"id": "7l1sgTpu8WoVJCVjIdRLLE", "name": "Wake Up / Wind Down (US)", "description": "Beautifully crafted audio to start and end your day", "genre": "religion spirituality", "languages": ["en"], "publisher": "Spotify Studios", "show_rank": "2"}, "3Zwh39kXHAk9M6vZvofoxY": {"id": "3Zwh39kXHAk9M6vZvofoxY", "name": "Girls Gotta Eat", "description": "Why do guys just want to f*ck you once then stalk your Instagram forever? Should you ditch the apps and meet people in the wild? How do you get over a breakup when you feel like you're gonna die?  These are all topics discussed on Girls Gotta Eat -- a comedy podcast about dating, sex, and relationships co-hosted by Ashley Hesseltine and Rayna Greenberg.", "genre": "lifestyle health", "languages": ["en"], "publisher": "Ashley Hesseltine and Rayna Greenberg", "show_rank": "7"}, "24eKquCRxqOzM7qwVyVcNd": {"id": "24eKquCRxqOzM7qwVyVcNd", "name": "Daily Quote", "description": "Whether you’re jumpstarting the morning, searching for that midday pick-me-up, or trying to finish the evening off strong… Daily Quote offers some of history’s most inspirational quotes whenever you need them—365 days a year. In this 2-3 minute podcast, you’ll be given a quote that will motivate, uplift, and renew your outlook on life. You’ll also dive deeper into the context surrounding the quote—learning more about its origin and the meaning behind it.", "genre": "leisure", "languages": ["en"], "publisher": "Parcast Network", "show_rank": "5"}, "5RdShpOtxKO3ZWohR2M6Sv": {"id": "5RdShpOtxKO3ZWohR2M6Sv", "name": "Conspiracy Theories", "description": "The truth is rarely the best story. And when it’s not the only story, the truth deserves another look. Every Wednesday, we tell the complicated stories behind the world’s most controversial events and possible cover-ups. Conspiracy? Maybe. Coincidence? Maybe. Complicated? Absolutely. Conspiracy Theories is part of the Parcast Network and is a Cutler Media Production.", "genre": "history", "languages": ["en"], "publisher": "Parcast Network", "show_rank": "2"}, "2hmkzUtix0qTqvtpPcMzEL": {"id": "2hmkzUtix0qTqvtpPcMzEL", "name": "Radiolab", "description": "Radiolab is one of the most beloved podcasts and public radio shows in the world. The show is known for its deep-dive journalism and innovative sound design. Created in 2002 by host Jad Abumrad, the program began as an exploration of scientific inquiry. Over the years it has evolved to become a platform for long-form journalism and storytelling. Radiolab is co-hosted by Lulu Miller and Latif Nasser. ", "genre": "stories", "languages": ["en-US"], "publisher": "WNYC Studios", "show_rank": "7"}, "1RefFgQB4Lrl7qczcTWA3o": {"id": "1RefFgQB4Lrl7qczcTWA3o", "name": "You're Wrong About", "description": "Mike and Sarah are journalists obsessed with the past. Every week they reconsider a person or event that's been miscast in the public imagination.", "genre": "history", "languages": ["en"], "publisher": "Michael Hobbes & Sarah Marshall", "show_rank": "4"}, "6Mk7Wk6cmrgXWnitO3NdYe": {"id": "6Mk7Wk6cmrgXWnitO3NdYe", "name": "Unsolved Murders: True Crime Stories", "description": "Unsolved Murders: True Crime Stories is a podcast drama with a modern twist on old time radio that delves into the mystery of true cold cases and unsolved murders. With the help of an ensemble cast, follow our hosts as they take you on an entertaining journey through the crime scene, the investigation and attempt to solve the case. With many surprising plot twists, it’s important you start listening from the first episode of a cold case. New episodes are released every Tuesday. Unsolved Murders: True Crime Stories is part of the Parcast Network and is a Cutler Media Production.", "genre": "history", "languages": ["en"], "publisher": "Parcast Network", "show_rank": "5"}, "25PdDOYwfXDFvZ4pI1JWDh": {"id": "25PdDOYwfXDFvZ4pI1JWDh", "name": "Lore", "description": "Lore is a bi-weekly podcast (as well as a TV show and book series) about dark historical tales. Each episode explores the mysterious creatures, tragic events, and unusual places that fill the pages of history. Because sometimes the truth is more frightening than fiction.", "genre": "history", "languages": ["en"], "publisher": "Aaron Mahnke and Grim & Mild", "show_rank": "6"}, "2GmNzw8t4uG70rn4XG9zcC": {"id": "2GmNzw8t4uG70rn4XG9zcC", "name": "Today in True Crime ", "description": "Crime never takes a day off, and neither does Parcast. Every day, we flip back the calendar and examine a true crime event from the same date. It might be the anniversary of an important case being solved, the end of a landmark trial, or a serial killer’s birthday-- whatever the date, there’s no ordinary day in true crime history. In each episode, we present a short true crime story, then analyze the impact of that historic day’s events. Today in True Crime is a Parcast Original, with new episodes daily.", "genre": "true crime", "languages": ["en"], "publisher": "Parcast Network", "show_rank": "7"}, "0rOatMqaG3wB5BF4AdsrSX": {"id": "0rOatMqaG3wB5BF4AdsrSX", "name": "Behind the Bastards", "description": "There’s a reason the History Channel has produced hundreds of documentaries about Hitler but only a few about Dwight D. Eisenhower. Bad guys (and gals) are eternally fascinating. Behind the Bastards dives in past the Cliffs Notes of the worst humans in history and exposes the bizarre realities of their lives. Listeners will learn about the young adult novels that helped Hitler form his monstrous ideology, the founder of Blackwater’s insane quest to build his own Air Force, the bizarre lives of the sons and daughters of dictators and Saddam Hussein’s side career as a trashy romance novelist.", "genre": "stories", "languages": ["en"], "publisher": "iHeartRadio", "show_rank": "6"}, "2dzMey4yRYKX5NWKp8zPrd": {"id": "2dzMey4yRYKX5NWKp8zPrd", "name": "Sword and Scale", "description": "       The Sword and Scale true-crime podcast is an immersive audio experience covering the dark side of humanity and human nature. Our stories delve into the worst of the worst and include murder, rape, dismemberment and cannibalism. The worst monsters are real.     ", "genre": "history", "languages": ["en"], "publisher": "Incongruity", "show_rank": "10"}, "4P6qJs5e5hrxWE6UzIS4Ea": {"id": "4P6qJs5e5hrxWE6UzIS4Ea", "name": "Geekin' On WDW Podcast | A Family Friendly Community of Walt Disney World Fans | Travel tips on resorts, food, touring and fun!", "description": "You're vacation is Important!  Dream it. Plan it. Take it. Tell us about it.", "genre": "kids family", "languages": ["en"], "publisher": "Curtis & Lindsay Stone: Father/Daughter Walt Disney World Geeks", "show_rank": "1"}, "7rb8eiXKJpg8gjmiY4yDAN": {"id": "7rb8eiXKJpg8gjmiY4yDAN", "name": "15 Hour Sound Machines (no loops or fades)", "description": "*Please note that on Spotify this is limited to 3 hours for some reason. For all 15 hours, use another platform to listen (Apple & Google Podcasts both have the entire length available). |   Parents...travelers...noisy neighbor sufferers...rejoice! 15 hours of Brown, Pink, and White noise with no loops, fades, or other interruptions.  Brown Noise is the lowest pitch, Pink Noise is a medium pitch (combination of Brown and White Noise), and White Noise is the highest pitch.", "genre": "kids family", "languages": ["en"], "publisher": "Brandon Reed", "show_rank": "2"}, "0OHMYcZChEVgTx2jz0yzze": {"id": "0OHMYcZChEVgTx2jz0yzze", "name": "Story Pirates", "description": "The Story Pirates believe that kids are creative geniuses. All of them. The Story Pirates are a nationally renowned group of top comedians, musicians, best-selling authors, and incredible teachers with fifteen years of experience creating content that celebrates the imaginations of kids. Winner of both the 2020 iHeartRadio Award and the Webby Award for Best Kids and Family Podcast, The Story Pirates Podcast is one of the top kids and family podcasts in the world. The Pirates have released three critically acclaimed middle-grade books with Random House Children’s Books and several award-winning albums, all based on ideas from kids around the world. The Creator Club, their subscription service, features activities, live-streamed classes, a weekend radio show, and videos to entertain and encourage creativity for kids at home. Get the latest from the Story Pirates at storypirates.com/news", "genre": "kids family", "languages": ["en"], "publisher": "Gimlet", "show_rank": "4"}, "70QlYnLX3izDdFhlKfOaeF": {"id": "70QlYnLX3izDdFhlKfOaeF", "name": "The Two Princes", "description": "Rupert and Amir are finally getting married and this time nothing is going to stop them. Not the handsome new prince who’s rolled into town and only has eyes for Rupert. Not the mysterious disappearance of half the kingdom’s population. Not even the End of the World. Yes, this time the princes are definitely, absolutely, 100% getting married – even if it’s the last thing they do. Season 3 is out now!  The Two Princes stars Noah Galvin, Ari'el Stachel, Jonah Fields, Gideon Glick, Michelle Gomez, Mandi Masden, Wesley Taylor, Samira Wiley, and CJ Wilson. The Two Princes was written by Kevin Christopher Snipes and directed by Mimi O’Donnell. Music and lyrics by Matt Schatz.  Executive producer Mimi O'Donnell, senior producer Katie Pastore, associate producer Julie Balefsky. Recorded and mixed by Jonathon Roberts, engineered by Armando Serrano, sound design by Daniel Brunelle. Music direction by Jonathon Roberts. Score by Greg Laswell.", "genre": "kids family", "languages": ["en"], "publisher": "Gimlet", "show_rank": "5"}, "1HhK3f5Fk2EBplKMLvYVnQ": {"id": "1HhK3f5Fk2EBplKMLvYVnQ", "name": "Wow in the World", "description": "The #1 podcast for kids and their grown-ups. Hosts Mindy Thomas and Guy Raz share stories about the latest news in science, technology, and innovation. Stories that give kids hope, agency and make us all say \"WOW\"!", "genre": "kids family", "languages": ["en"], "publisher": "Tinkercast", "show_rank": "6"}, "4G0FH2LW1yTCRoX2Ux0ZE6": {"id": "4G0FH2LW1yTCRoX2Ux0ZE6", "name": "RELAX! with Colleen Ballinger & Erik Stocklin", "description": "Colleen Ballinger has been sharing her life publicly to millions of people online for over a decade, while her husband Erik Stocklin lives a much more private life and barely knows how to use social media. This unlikely couple spends an hour each week discussing anything, everything and sometimes nothing at all about their unique world. Every episode is an open and honest discussion that often leads to discoveries and revelations as they (along with the rest of us) navigate these unprecedented times.", "genre": "kids family", "languages": ["en"], "publisher": "Audioboom", "show_rank": "7"}, "695BG5wFULOIoKozKPiWZV": {"id": "695BG5wFULOIoKozKPiWZV", "name": "Kids Short Stories", "description": "Welcome to the family :) Where we turn your kids ideas into awesome adventures!   Click Subscribe/Follow so that you don't miss a single episode  If you would like your own short story, head over to kidsshortstories.org. Include your child's name and something like...\"my son/daughter (name) loves catching bad guys and is really good at painting and loves trucks...\" or whatever fun idea that your child has! Then Mr. Jim will build an amazing story around your submission!", "genre": "kids family", "languages": ["en"], "publisher": "Kids Stories | Jim Jacob", "show_rank": "8"}, "7CVraZSioRYbJvE5f4eXv1": {"id": "7CVraZSioRYbJvE5f4eXv1", "name": "Dreamful Bedtime Stories", "description": "Bedtime Stories for Slumber. Each episode is a dreamy story accompanied by music to help you drift into a deep sleep. ", "genre": "kids family", "languages": ["en"], "publisher": "Jordan Blair", "show_rank": "9"}, "02GlhvVTh4jPj0VNtb3FXD": {"id": "02GlhvVTh4jPj0VNtb3FXD", "name": "Honeybee Kids - Bedtime Stories", "description": "My name is Mrs. Honeybee and my mission is to make bedtime easier! 😊💕 I write bedtime stories inspired by movies that I love. Toy Story, Pokemon, Lion King, Peppa Pig, and Frozen are some of my most popular! I’m a school teacher, mother of two, and a storyteller 😊 - Love, Mrs. Honeybee", "genre": "kids family", "languages": ["en"], "publisher": "Mrs. Honeybee", "show_rank": "10"}, "6i9SWtZPb30xVXWVHSKCqq": {"id": "6i9SWtZPb30xVXWVHSKCqq", "name": "Trash Taste Podcast", "description": "Trash Taste is a highly anticipated anime podcast exploring anime, manga, and otaku culture with top anime YouTubers Joey from the The Anime Man, Garnt from Gigguk, and Connor from Cdawgva and occasionally special guests.", "genre": "leisure", "languages": ["en"], "publisher": "Joey (TheAnimeMan), Garnt (Gigguk), and Connor (CDawgVA)", "show_rank": "9"}, "3NViCWfbhXn8c3NauVpa2B": {"id": "3NViCWfbhXn8c3NauVpa2B", "name": "Wizard and the Bruiser", "description": "Holden McNeely and Jake Young are your guides on a psychotropic journey into the secret origins of nerd culture. Fill your ears with education each week as the hosts tackle subjects from the worlds of comic books, video games, anime and film. Untold stories, bizarre facts and crazed deconstructions will fly at you at dangerous speeds, do not listen if you are pregnant or nursing. Make no mistake, this IS the sweatiest podcast in human history.", "genre": "leisure", "languages": ["en"], "publisher": "The Last Podcast Network", "show_rank": "10"}, "42xagXCUDsFO6a0lcHoTlv": {"id": "42xagXCUDsFO6a0lcHoTlv", "name": "Renegades: Born in the USA", "description": "Renegades: Born in the USA is a series of conversations between President Barack Obama and Bruce Springsteen about their lives, music, and enduring love of America—despite all its challenges.", "genre": "society culture", "languages": ["en"], "publisher": "Higher Ground", "show_rank": "1"}, "4ov7WzQzOWTyPC2EhPfPDo": {"id": "4ov7WzQzOWTyPC2EhPfPDo", "name": "Uncle Joey's Joint", "description": "Uncle Joey's Joint with: Joey Coco Diaz is a twice-weekly podcast hosted by Comedian Joey Coco Diaz. Joey doesn't hold anything back and lets you know exactly what's on his mind. Welcome to The Joint.", "genre": "tv film", "languages": ["en"], "publisher": "Joey Coco Diaz", "show_rank": "7"}, "25auwWceZnlOEK6SwtO1y1": {"id": "25auwWceZnlOEK6SwtO1y1", "name": "Pop Culture Happy Hour", "description": "Get obsessed with us. Five days a week, Pop Culture Happy Hour serves you recommendations and commentary on the buzziest movies, TV, music, books, videogames and more. Join arts journalists Linda Holmes, Glen Weldon, Stephen Thompson, and Aisha Harris - plus a rotating cast of guest pop culture aficionados. The Happy Hour team leaves room at the table for exploring a range of reactions and opinions on every bit of the pop universe. From lowbrow to highbrow to the stuff in between, they take it all with a shot of cheer.", "genre": "tv film", "languages": ["en"], "publisher": "NPR", "show_rank": "10"}, "10lMwCjvzLCLwth2AW6cLG": {"id": "10lMwCjvzLCLwth2AW6cLG", "name": "Song Exploder", "description": "       Song Exploder is a podcast where musicians take apart their songs, and piece by piece, tell the story of how they were made. Each episode features an artist discussing a song of theirs, breaking down the sounds and ideas that went into the writing and recording. Hosted and produced by Hrishikesh Hirway.     ", "genre": "music", "languages": ["en"], "publisher": "Hrishikesh Hirway", "show_rank": "6"}, "7pg4bQx8OsDIiDFZ7XtKy0": {"id": "7pg4bQx8OsDIiDFZ7XtKy0", "name": "No Dogs in Space", "description": "No Dogs In Space is a music history podcast featuring Marcus Parks and Carolina Hidalgo of the Last Podcast Network. On this first season, we're taking a deep dive into the history of punk rock, told through the stories of ten bands who helped define the genre. On our first series, we cover the so-called godfathers of punk, The Stooges. Join us as we explore the early days of Iggy and the boys as the more innocent of their drug-fueled escapades as the band tries figuring out their voice in the midst of the ultimately empty peace and love movement.", "genre": "music", "languages": ["en"], "publisher": "The Last Podcast Network", "show_rank": "7"}, "3eV0MuWs5OBTluijGMPnLB": {"id": "3eV0MuWs5OBTluijGMPnLB", "name": "Jojo's ASMR", "description": "I'm a 21 years old full-time university student who grew up missing a lot of needed sleep. The focus and vision of this channel is to give to you all what i couldn't give myself in years that i needed sleep most. ASMR has become a viral, International phenomenon as it helps to relax and destress!", "genre": "music", "languages": ["en"], "publisher": "Smd Ishan", "show_rank": "8"}, "1CtRqrNGqpAttWyft6nVss": {"id": "1CtRqrNGqpAttWyft6nVss", "name": "Drink Champs", "description": "Legendary Queens rapper-turned show host N.O.R.E. teams up with Miami hip-hop pioneer DJ EFN for a night of boozy conversation and boisterous storytelling. The hosts and guests engage together in fun, light-hearted conversation - looking back at their paths to success, highlighting their lives, friendships, and iconic moments within their career. In this unfiltered series, drinks are flowing and jokes are rolling - take a seat at the table with N.O.R.E & EFN. You Gotta Relax!", "genre": "music", "languages": ["en"], "publisher": "The Black Effect & iHeartRadio", "show_rank": "9"}, "2XbVewJK4SaWeZYiQ8u8tB": {"id": "2XbVewJK4SaWeZYiQ8u8tB", "name": "Childz Play", "description": "The world's premier Kidz Bop review podcast! With Adam H. Phillips and R. Alex Murray.", "genre": "music", "languages": ["en"], "publisher": "Missing Sock", "show_rank": "10"}, "3IM0lmZxpFAY7CwMuv9H4g": {"id": "3IM0lmZxpFAY7CwMuv9H4g", "name": "The Daily", "description": "This is what the news should sound like. The biggest stories of our time, told by the best journalists in the world. Hosted by Michael Barbaro. Twenty minutes a day, five days a week, ready by 6 a.m.", "genre": "news politics", "languages": ["en"], "publisher": "The New York Times", "show_rank": "1"}, "6BRSvIBNQnB68GuoXJRCnQ": {"id": "6BRSvIBNQnB68GuoXJRCnQ", "name": "NPR News Now", "description": "The latest news in five minutes. Updated hourly.", "genre": "news politics", "languages": ["en-US"], "publisher": "NPR", "show_rank": "2"}, "2mTUnDkuKUkhiueKcVWoP0": {"id": "2mTUnDkuKUkhiueKcVWoP0", "name": "Up First", "description": "NPR's Up First is the news you need to start your day. The three biggest stories of the day, with reporting and analysis from NPR News — in 10 minutes. Available weekdays by 6 a.m. ET, with hosts Rachel Martin, Noel King and Steve Inskeep. Now available on Saturdays by 8 a.m. ET, with hosts Lulu Garcia-Navarro and Scott Simon. Subscribe and listen, then support your local NPR station at donate.npr.org.", "genre": "news politics", "languages": ["en-US"], "publisher": "NPR", "show_rank": "3"}, "0KxdEdeY2Wb3zr28dMlQva": {"id": "0KxdEdeY2Wb3zr28dMlQva", "name": "The Journal.", "description": "The most important stories, explained through the lens of business. A podcast about money, business and power. Hosted by Kate Linebaugh and Ryan Knutson. The Journal is a co-production from Gimlet Media and The Wall Street Journal.", "genre": "news politics", "languages": ["en"], "publisher": "The Wall Street Journal & Gimlet", "show_rank": "4"}, "3MGn724Y6BOSQzfmk3TyuY": {"id": "3MGn724Y6BOSQzfmk3TyuY", "name": "Dateline NBC", "description": "Current and classic episodes, featuring compelling true-crime mysteries, powerful documentaries and in-depth investigations.  ", "genre": "true crime", "languages": ["en"], "publisher": "NBC News", "show_rank": "5"}, "1WErgoXiZwgctkHLzqU6nf": {"id": "1WErgoXiZwgctkHLzqU6nf", "name": "The Ben Shapiro Show", "description": "Tired of the lies? Tired of the spin? Are you ready to hear the hard-hitting truth in comprehensive, conservative, principled fashion? The Ben Shapiro Show brings you all the news you need to know in the most fast moving daily program in America. Ben brutally breaks down the culture and never gives an inch!", "genre": "news politics", "languages": ["en"], "publisher": "The Daily Wire", "show_rank": "6"}, "2rTT1klKUoQNuaW2Ah19Pa": {"id": "2rTT1klKUoQNuaW2Ah19Pa", "name": "Short Wave", "description": "New discoveries, everyday mysteries, and the science behind the headlines — all in about 10 minutes, every weekday. It's science for everyone, using a lot of creativity and a little humor. Join host Maddie Sofia for science on a different wavelength.", "genre": "science", "languages": ["en-US"], "publisher": "NPR", "show_rank": "2"}, "5JGorGvdwljJHTl6wpMXN3": {"id": "5JGorGvdwljJHTl6wpMXN3", "name": "Pod Save America", "description": "Four former aides to President Obama—Jon Favreau, Jon Lovett, Dan Pfeiffer and Tommy Vietor—are joined by journalists, politicians, activists, and more for a no-b******t conversation about politics. They cut through the noise to break down the week’s news, and help people figure out what matters and how they can help. Text us questions and comments: (323) 405-9944. New episodes Mondays and Thursdays.", "genre": "news politics", "languages": ["en"], "publisher": "Crooked Media", "show_rank": "9"}, "6gcw7EF2i70vXXXJnhBNgA": {"id": "6gcw7EF2i70vXXXJnhBNgA", "name": "It's Been a Minute with Sam Sanders", "description": "Each week, Sam Sanders interviews people in the culture who deserve your attention. Plus weekly wraps of the news with other journalists. Join Sam as he makes sense of the world through conversation.", "genre": "religion spirituality", "languages": ["en-US"], "publisher": "NPR", "show_rank": "1"}, "0TjebIuTnshPsvvbJ1X6Nr": {"id": "0TjebIuTnshPsvvbJ1X6Nr", "name": "Virgo Today", "description": "Born between August 23rd and September 22nd, you are a Virgo. Humble and organized, you are the most reliable of all your friends. Let Virgo Today guide you through love, compatibility, personal and professional growth. Virgo Today is a Parcast Original, new episodes release daily. Special thanks to Sanctuary.", "genre": "religion spirituality", "languages": ["en"], "publisher": "Parcast Network", "show_rank": "3"}, "2yUUwd0EjDE7mYdi8hsqg4": {"id": "2yUUwd0EjDE7mYdi8hsqg4", "name": "Cancer Today", "description": "Born between June 21st and July 22nd, you are a Cancer. Resourceful and loving, you create security for all of those around you. Let Cancer Today guide you through love, compatibility, personal and professional growth. Cancer Today is a Parcast Original, new episodes release daily. Special thanks to Sanctuary.", "genre": "religion spirituality", "languages": ["en"], "publisher": "Parcast Network", "show_rank": "4"}, "4Pppt42NPK2XzKwNIoW7BR": {"id": "4Pppt42NPK2XzKwNIoW7BR", "name": "The Bible in a Year (with Fr. Mike Schmitz)", "description": "In The Bible in a Year podcast, Fr. Mike Schmitz walks you through the entire Bible in 365 episodes, providing commentary, reflection, and prayer along the way. Unlike any other Bible podcast, Ascension’s Bible in a Year podcast follows a reading plan inspired by The Great Adventure Bible Timeline, a ground-breaking approach to understanding salvation history developed by renowned Catholic Bible scholar Jeff Cavins. For each period in the timeline, Jeff will join Fr. Mike for a special episode that will help you understand the context of each reading. With this podcast, you won’t just read the Bible in a year … you’ll finally understand how all the pieces of the Bible fit together to tell an amazing story that continues in your life today! Listen and… Read the ENTIRE Bible Feel more confident about your understanding of Scripture Experience the transformative power of God’s Word in your daily life Start seeing the world through the lens of Scripture Each 20-25 minute episode includes: Two to three scripture readings A reflection from Fr. Mike Schmitz A guided prayer to help you hear God’s voice in his Word The Bible contains adult themes that may not be suitable for children - parental discretion is advised. ", "genre": "religion spirituality", "languages": ["en-US"], "publisher": "Ascension Catholic Faith Formation", "show_rank": "5"}, "4fTBdgBDeKPJnnUHTaQVyb": {"id": "4fTBdgBDeKPJnnUHTaQVyb", "name": "Leo Today", "description": "Born between July 23rd and August 22nd, you are a Leo. Fiery and honest, you have a vivacious spirit. Let Leo Today guide you through love, compatibility, personal and professional growth. Leo Today is a Parcast Original, new episodes release daily. Special thanks to Sanctuary.", "genre": "religion spirituality", "languages": ["en"], "publisher": "Parcast Network", "show_rank": "6"}, "6nLlNUMm4VuZE1ln9oOJvy": {"id": "6nLlNUMm4VuZE1ln9oOJvy", "name": "Elevation with Steven Furtick", "description": "Welcome to the weekly podcast of Elevation Church led by Pastor Steven Furtick. To learn more visit our website at http://elevationchurch.org or download the Elevation App. To support this ministry and help us continue to reach people all around the world click here: http://ele.vc/TI55jR", "genre": "religion spirituality", "languages": ["en"], "publisher": "Elevation Church", "show_rank": "7"}, "3u7upoZMnHoXE9zzAM3Lly": {"id": "3u7upoZMnHoXE9zzAM3Lly", "name": "Aries Today", "description": "Born between March 21st and April 19th, you are an Aries. Motivated and passionate, you are a driven leader. Let Aries Today guide you through love, compatibility, personal and professional growth. Aries Today is a Parcast Original, new episodes release daily. Special thanks to Sanctuary.", "genre": "religion spirituality", "languages": ["en"], "publisher": "Parcast Network", "show_rank": "8"}, "7vQ6JYRGJsuDOUcafwH5Jl": {"id": "7vQ6JYRGJsuDOUcafwH5Jl", "name": "Taurus Today", "description": "Born between April 20th and May 20th, you are a Taurus. Strong-willed and unwavering, you are extremely loyal. Let Taurus Today guide you through love, compatibility, personal and professional growth. Taurus Today is a Parcast Original, new episodes release daily. Special thanks to Sanctuary.", "genre": "religion spirituality", "languages": ["en"], "publisher": "Parcast Network", "show_rank": "9"}, "67ZOy6ZGj3VmcisMgP9t0j": {"id": "67ZOy6ZGj3VmcisMgP9t0j", "name": "Aquarius Today", "description": "Born between January 20th and February 18th, you are an Aquarius. Free spirited and eccentric, you seek to change the world. Let Aquarius Today guide you through love, compatibility, personal and professional growth. Aquarius Today is a Parcast Original, new episodes release daily. Special thanks to Sanctuary.", "genre": "religion spirituality", "languages": ["en"], "publisher": "Parcast Network", "show_rank": "10"}, "2MAi0BvDc6GTFvKFPXnkCL": {"id": "2MAi0BvDc6GTFvKFPXnkCL", "name": "Lex Fridman Podcast", "description": "Conversations about AI, science, technology, history, philosophy and the nature of intelligence, consciousness, love, and power. Formerly called the Artificial Intelligence (AI) podcast. Lex is an AI researcher at MIT and beyond.", "genre": "technology", "languages": ["en"], "publisher": "Lex Fridman", "show_rank": "1"}, "5nvRkVMH58SelKZYZFZx1S": {"id": "5nvRkVMH58SelKZYZFZx1S", "name": "Ologies with Alie Ward", "description": "Volcanoes. Trees. Drunk butterflies. Mars missions. Slug sex. Death. Beauty standards. Anxiety busters. Beer science. Bee drama. Take away a pocket full of science knowledge and charming, bizarre stories about what fuels these professional -ologists' obsessions. Humorist and science correspondent Alie Ward asks smart people stupid questions and the answers might change your life.", "genre": "science", "languages": ["en"], "publisher": "Alie Ward", "show_rank": "8"}, "0ofXAdFIQQRsCYj9754UFx": {"id": "0ofXAdFIQQRsCYj9754UFx", "name": "Stuff You Should Know", "description": "If you've ever wanted to know about champagne, satanism, the Stonewall Uprising, chaos theory, LSD, El Nino, true crime and Rosa Parks, then look no further. Josh and Chuck have you covered.", "genre": "society culture", "languages": ["en"], "publisher": "iHeartRadio", "show_rank": "5"}, "3oEPsPKDhPVoNNL7pH5db6": {"id": "3oEPsPKDhPVoNNL7pH5db6", "name": "Dare to Lead with Brené Brown", "description": "Brené’s newest podcast is based on her book, Dare to Lead, which debuted at #1 on the New York Times, and Wall Street Journal bestseller lists, and has become the ultimate courage-building playbook for leaders at every level. Brené writes, “The Dare to Lead podcast will be a mix of solo episodes and conversations with change-catalysts, culture-shifters, and as many troublemakers as possible. Innovating, creating, and building a better, more just world, requires daring leadership in every part of our daily lives – from work to home to community. Together, we’ll have conversations that help us show up, step up, and dare to lead.”", "genre": "society culture", "languages": ["en"], "publisher": "Parcast Network", "show_rank": "8"}, "29jsdqzu9DgkbUawzYgDN4": {"id": "29jsdqzu9DgkbUawzYgDN4", "name": "Supernatural with Ashley Flowers", "description": "Most mysteries can be solved by looking at the facts. But sometimes, the facts don’t lead to a logical explanation, and the truth lies somewhere in the unknown… Join Parcast and Crime Junkie’s Ashley Flowers as they dive deep into the strange and surreal to explain some of the world’s most bizarre true crime occurrences in the new series, Supernatural with Ashley Flowers. Every Wednesday, Ashley digs into a different mystifying crime—where the most fitting theory isn’t always the most conventional.", "genre": "society culture", "languages": ["en"], "publisher": "Parcast Network", "show_rank": "10"}, "5ss1pqMFqWjkOpt6Ag0fZW": {"id": "5ss1pqMFqWjkOpt6Ag0fZW", "name": "Pardon My Take", "description": "On \"Pardon My Take,\" Big Cat & PFT Commenter deliver the loudest and most correct sports takes in the history of the spoken word. Daily topics, guests, and an inability to tell what the hosts might be doing will make this your new favorite sports talk show. This is a podcast that will without a doubt change your life for the better- guaranteed, or your money back. *Pretend a reggaeton air horn is going off right now* PMT.", "genre": "sports recreation", "languages": ["en-US"], "publisher": "Barstool Sports", "show_rank": "1"}, "07SjDmKb9iliEzpNcN2xGD": {"id": "07SjDmKb9iliEzpNcN2xGD", "name": "The Bill Simmons Podcast", "description": "HBO and The Ringer's Bill Simmons hosts the most downloaded sports podcast of all time, with a rotating crew of celebrities, athletes, and media staples, as well as mainstays like Cousin Sal, Joe House, and a slew of other friends and family members who always happen to be suspiciously available.", "genre": "tv film", "languages": ["en"], "publisher": "The Ringer & Bill Simmons", "show_rank": "2"}, "2XdegS23ImVZldex799DUS": {"id": "2XdegS23ImVZldex799DUS", "name": "The Ryen Russillo Podcast", "description": "Each week, Ryen Russillo will break down the biggest topics in sports.", "genre": "sports recreation", "languages": ["en"], "publisher": "The Ringer", "show_rank": "3"}, "1ol0jP8hrNHydiAd38G6B1": {"id": "1ol0jP8hrNHydiAd38G6B1", "name": "The Pat McAfee Show 2.0", "description": "On The Pat McAfee Show 2.0, Pat McAfee and his friends deliver one of a kind opinions that won't be heard anywhere else. Pat, who played in two Pro Bowls during his eight-year NFL career, brings a fresh take on sports and entertainment to listeners and fans. He is known for speaking his mind and is both relatable and refreshing. His player’s insight, electric storytelling, and robust sense of humor have helped him build a huge and loyal fan base with more than 3 million social media followers. Presented by FanDuel, The Pat McAfee Show 2.0 promises to inform, intrigue, and entertain. Cheers.", "genre": "sports recreation", "languages": ["en"], "publisher": "Pat McAfee", "show_rank": "4"}, "4WkDOrAK3uASgK2PRF7j9M": {"id": "4WkDOrAK3uASgK2PRF7j9M", "name": "The MeatEater Podcast", "description": "Building on the belief that a deeper understanding of the natural world enriches all of our lives, host Steven Rinella brings an in-depth and relevant look at all outdoor topics including hunting, fishing, nature, conservation, and wild foods. Filled with humor, irreverence, and things that will surprise the hell out of you, each episode welcomes a diverse group of guests who add their own expertise to the vast world of the outdoors. Part of The MeatEater Podcast Network.", "genre": "sports recreation", "languages": ["en"], "publisher": "MeatEater", "show_rank": "5"}, "7IWzayPhHif6GhgtTQdB84": {"id": "7IWzayPhHif6GhgtTQdB84", "name": "Spittin Chiclets", "description": "Former NHL vets Ryan Whitney, Paul Bissonnette, Barstool Sports writer Rear Admiral and Producer Mike Grinnell bring their outspoken and irreverent opinions to the masses. Focusing on the NHL but also touching on pop culture and everything else under the sun. New episode every Tuesday..", "genre": "sports recreation", "languages": ["en-US"], "publisher": "Barstool Sports", "show_rank": "6"}, "5jUeKBONOmKJivqrRoIDJn": {"id": "5jUeKBONOmKJivqrRoIDJn", "name": "The Ringer NBA Show", "description": "The Ringer NBA team breaks down the latest news, trends, and transactions around the league up to five days a week. MON: 'Real Ones' with Logan Murdock & Raja Bell TUE: 'Group Chat' with Justin Verrier, Rob Mahoney & Jonathan Tjarks WED: 'Ringer NBA University' with Kevin O'Connor, Jonathan Tjarks & J. Kyle Mann (Bi-weekly) THURS: 'Real Ones' with Logan Murdock & Raja Bell FRI: 'The Answer' with Chris Ryan", "genre": "sports recreation", "languages": ["en"], "publisher": "The Ringer", "show_rank": "7"}, "2mZHt3zBxyIuc0PYLdDDkr": {"id": "2mZHt3zBxyIuc0PYLdDDkr", "name": "The Lowe Post", "description": "ESPN's Zach Lowe talks to various basketball people about various basketball things.", "genre": "sports recreation", "languages": ["en-US"], "publisher": "ESPN, Zach Lowe", "show_rank": "8"}, "2FuorRyd1NSURMWW9Ab7lj": {"id": "2FuorRyd1NSURMWW9Ab7lj", "name": "The Dan Le Batard Show with Stugotz", "description": "From their Oceanside studios at the Clevelander Hotel in Miami Beach, Dan Le Batard, Stugotz and company share their unique perspectives on all-things sports, pop-culture and more. This is the place for original content from Lebatard and Stu Gotz, including the daily “Local Hour” generally focusing on the South Florida scene, the Big Suey, and a few more surprises along the way.", "genre": "sports recreation", "languages": ["en"], "publisher": "Dan Le Batard, Stugotz", "show_rank": "9"}, "17GacVP62XZmK5FuOLUpd1": {"id": "17GacVP62XZmK5FuOLUpd1", "name": "The Mismatch", "description": "Kevin O’Connor and Chris Vernon discuss all the news, trends, and transactions happening in the NBA. They also offer their on-court analysis, and occasionally get into heated debates.", "genre": "sports recreation", "languages": ["en"], "publisher": "The Ringer ", "show_rank": "10"}, "308BQUUnIkoH2UAXJCAt0g": {"id": "308BQUUnIkoH2UAXJCAt0g", "name": "My Brother, My Brother And Me", "description": "Free advice from three of the world's most qualified, most related experts: Justin, Travis and Griffin McElroy. For one-half to three-quarters of an hour every Monday, we tell people how to live their lives, because we're obviously doing such a great job of it so far.", "genre": "stories", "languages": ["en"], "publisher": "The McElroys", "show_rank": "1"}, "3JWnH3U4VPJI6DlB0YsiKm": {"id": "3JWnH3U4VPJI6DlB0YsiKm", "name": "And That's Why We Drink", "description": "Murder and the paranormal finally meet! Grab your wine and milkshakes and join us every Sunday for some chilling ghost stories and downright terrifying true crime stories. The world's a scary place. And that's why we drink! ", "genre": "true crime", "languages": ["en"], "publisher": "Kast Media", "show_rank": "8"}, "5VzFvh1JlEhBMS6ZHZ8CNO": {"id": "5VzFvh1JlEhBMS6ZHZ8CNO", "name": "Anything Goes with Emma Chamberlain", "description": "Emma has a LOT on her mind. Good thing she has a podcast to talk about it all. Appropriately named, anything really does go on this podcast. Thoughts, conversations, and advice on topics from relationships and dealing with failure, to the trials and tribulations of being a cat mom, and ridiculous stories with friends we can all relate to. It’s raw, intimate, and nothing is off limits (seriously, Anything Goes). It may be serious, it’ll mostly be funny, and it’ll always be entertaining. New episodes every Thursday. ", "genre": "stories", "languages": ["en"], "publisher": "Emma Chamberlain and Ramble", "show_rank": "4"}, "6goGgtyzjWUzr9kgnWRDZi": {"id": "6goGgtyzjWUzr9kgnWRDZi", "name": "Zane and Heath: Unfiltered", "description": "Zane and Heath: Unfiltered is a weekly podcast from YouTube sensations; Zane Hijazi and Heath Hussar, two uneducated Florida boys with strong opinions and nothing to back it. Join them for some raw, uncut, and unfiltered behind the scenes content as they discuss all that transpires in their group's crazy lives when the cameras stop rolling. Be sure to grab your coffee and tune in every Monday morning because your start to the week just got a whole lot better! And by better, we mean worse.", "genre": "stories", "languages": ["en"], "publisher": "Zane & Heath", "show_rank": "9"}, "1lUPomulZRPquVAOOd56EW": {"id": "1lUPomulZRPquVAOOd56EW", "name": "The Rewatchables", "description": "'The Rewatchables,' a film podcast from the Ringer Podcast Network, features The Ringer’s Bill Simmons and a roundtable of people from The Ringer universe discussing movies they can’t seem to stop watching.", "genre": "tv film", "languages": ["en"], "publisher": "The Ringer & Bill Simmons", "show_rank": "3"}, "0HF5T1BVjaUR6dMlAamdB5": {"id": "0HF5T1BVjaUR6dMlAamdB5", "name": "Fresh Air", "description": "Fresh Air from WHYY, the Peabody Award-winning weekday magazine of contemporary arts and issues, is one of public radio's most popular programs. Hosted by Terry Gross, the show features intimate conversations with today's biggest luminaries.", "genre": "tv film", "languages": ["en"], "publisher": "NPR", "show_rank": "5"}, "0A3IirSc3Qi2MSFJcz2unj": {"id": "0A3IirSc3Qi2MSFJcz2unj", "name": "LPN Deep Dives: Dune", "description": "Last Podcast Network presents LPN Deep Dives: Dune, a 12-part weekly journey down the sandy wormhole of Frank Herbert’s beloved Sci-Fi Masterpiece, Dune (and it’s subsequent sequels). Navigated by the one and only God Emperor himself Henry Zebrowski (Last Podcast on The Left, Adult Swim) and his enigmatic spice fueled co-host Holden McNeely (Wizard and The Bruiser).", "genre": "tv film", "languages": ["en"], "publisher": "The Last Podcast Network", "show_rank": "6"}, "0oYGnOWNIj93Q1CCfQ4Mj8": {"id": "0oYGnOWNIj93Q1CCfQ4Mj8", "name": "We Hear: Quick Fix", "description": "We Hear: Quick Fix is a short week-in-review summary from the legendary Page Six gossip podcast We Hear. Page Six Senior Reporter Francesca Bacardi and Executive Editor Ian Mohr break down the biggest stories of the week - including The Joy of Six, the most satisfying piece of gossip. We Hear all the celebrity dirt from our exclusive sources.... and you hear the story behind the story!For all the juiciest gossip about celebrities and high society, subscribe to the Quick Fix.", "genre": "tv film", "languages": ["en"], "publisher": "Page Six", "show_rank": "8"}, "6f0FSSmasGlV0WjiCfoiYD": {"id": "6f0FSSmasGlV0WjiCfoiYD", "name": "SuperMegaCast", "description": "This critically acclaimed podcast from Oscar-nominated hosts Matt Watson and Ryan Magee, pushes the limits of humanity and searches for what it means to be alive. Nah, it's two friends who have a YouTube channel talking about whatever they feel like.  For advertising opportunities please email PodcastPartnerships@Studio71us.com", "genre": "tv film", "languages": ["en"], "publisher": "Matt Watson & Ryan Magee ", "show_rank": "9"}, "1vfOw64nKjQ8LzZDPCfRaO": {"id": "1vfOw64nKjQ8LzZDPCfRaO", "name": "TED Radio Hour", "description": "Exploring the biggest questions of our time with the help of the world's greatest thinkers. Host Manoush Zomorodi inspires us to learn more about the world, our communities, and most importantly, ourselves.", "genre": "technology", "languages": ["en"], "publisher": "NPR", "show_rank": "2"}, "7gozmLqbcbr6PScMjc0Zl4": {"id": "7gozmLqbcbr6PScMjc0Zl4", "name": "Reply All", "description": "\"'A podcast about the internet' that is actually an unfailingly original exploration of modern life and how to survive it.\" - The Guardian. Hosted by PJ Vogt, Alex Goldman and Emmanuel Dzotsi from Gimlet.", "genre": "technology", "languages": ["en"], "publisher": "Gimlet", "show_rank": "3"}, "4XPl3uEEL9hvqMkoZrzbx5": {"id": "4XPl3uEEL9hvqMkoZrzbx5", "name": "Darknet Diaries", "description": "Explore true stories of the dark side of the Internet with host Jack Rhysider as he takes you on a journey through the chilling world of hacking, data breaches, and cyber crime.", "genre": "technology", "languages": ["en"], "publisher": "Jack Rhysider", "show_rank": "4"}, "4MU3RFGELZxPT9XHVwTNPR": {"id": "4MU3RFGELZxPT9XHVwTNPR", "name": "Pivot", "description": "Every Tuesday and Friday, Recode’s Kara Swisher and NYU Professor Scott Galloway offer sharp, unfiltered insights into the biggest stories in tech, business, and politics. They make bold predictions, pick winners and losers, and bicker and banter like no one else. After all, with great power comes great scrutiny. From New York Magazine and the Vox Media Podcast Network.", "genre": "technology", "languages": ["en"], "publisher": "New York Magazine", "show_rank": "5"}, "2IqXAVFR4e0Bmyjsdc8QzF": {"id": "2IqXAVFR4e0Bmyjsdc8QzF", "name": "All-In with Chamath, Jason, Sacks & Friedberg", "description": "Industry veterans, degenerate gamblers & besties Chamath Palihapitiya, Jason Calacanis, David Sacks & David Friedberg cover all things economic, tech, political, social & poker.", "genre": "technology", "languages": ["en"], "publisher": "Jason Calacanis", "show_rank": "6"}, "1AALw43XftzNJGt1zXIOFg": {"id": "1AALw43XftzNJGt1zXIOFg", "name": "Rooster Teeth Podcast", "description": "On a weekly basis the Rooster Teeth crew discuss gaming, films, popular culture, the internet, and projects that they're currently working on. Watch LIVE every Monday at 5PM CT on svod.roosterteeth.com. Watch the free video version at YouTube.com/RoosterTeeth.", "genre": "technology", "languages": ["en"], "publisher": "Rooster Teeth", "show_rank": "7"}, "22fi0RqfoBACCuQDv97wFO": {"id": "22fi0RqfoBACCuQDv97wFO", "name": "Invest Like the Best with Patrick O'Shaughnessy", "description": "Exploring the ideas, methods, and stories of people that will help you better invest your time and money.  Learn more and stay-up-to-date at https://joincolossus.com/", "genre": "technology", "languages": ["en"], "publisher": "Colossus", "show_rank": "8"}, "2jXIy9OQZh2gI65OwfvaPq": {"id": "2jXIy9OQZh2gI65OwfvaPq", "name": "Crypto News Alerts | Daily Bitcoin (BTC) & Cryptocurrency News", "description": "Your one-stop source for all the latest Bitcoin (BTC) and Cryptocurrency news. The only podcast where 'stackin' sats' is a way of life. Seeking daily premium content? Then you're in the right place here! Stay informed with the best premium Crypto news on the planet. HODL!", "genre": "technology", "languages": ["en"], "publisher": "Justin Verrengia", "show_rank": "9"}, "7qZAVw03FuurfYnWIWwkHY": {"id": "7qZAVw03FuurfYnWIWwkHY", "name": "Naval", "description": "On Twitter at @naval.", "genre": "technology", "languages": ["en"], "publisher": "Naval", "show_rank": "10"}, "3DgfoleqaW61T2amZQKINx": {"id": "3DgfoleqaW61T2amZQKINx", "name": "Crime Junkie", "description": "If you can never get enough true crime... Congratulations, you’ve found your people.", "genre": "true crime", "languages": ["en"], "publisher": "audiochuck", "show_rank": "2"}, "2DZwvzn6Z3xCFZrwZGDrbj": {"id": "2DZwvzn6Z3xCFZrwZGDrbj", "name": "Rotten Mango", "description": "Rotten but still a little sweet! Rotten Mango is a true crime + all things spooky podcast. We love doing deep dives into the darkest crimes and we tend to not leave out any details - which can get a little rotten at times. If you want deep dives in the psychology of killers, no holding back storytelling of crimes, and stories of lesser known criminals from around the world this is the place for you. Welcome to Rotten Mango but don’t worry it all comes with a seasoning of comedy/sweetness.", "genre": "true crime", "languages": ["en"], "publisher": "Stephanie Soo & Audioboom", "show_rank": "9"}, "4ePgU1WrwXqAuViwAvNFLr": {"id": "4ePgU1WrwXqAuViwAvNFLr", "name": "Your Own Backyard", "description": "A documentary podcast series investigating the 1996 disappearance of Cal Poly student, Kristin Smart.", "genre": "true crime", "languages": ["en"], "publisher": "Chris Lambert", "show_rank": "10"}}